Repository: indice-co/Indice.AspNet
Catalog: src/Indice.Features.Identity.UI/Resources/Validators/RegisterInputModelValidator.*.resx
Languages: el

source: Field '{PropertyName}' can accept digits, uppercase or lowercase latin characters and the symbols -._@+
el: Το πεδίο '{PropertyName}' δέχεται νούμερα, κεφαλαίους και πεζούς λατινικούς χαρακτήρες καθώς και τα σύμβολα -._@+

source: First name
el: Όνομα

source: Last name
el: Επίθετο

source: Mobile phone
el: Κινητό τηλέφωνο

source: Mobile phone must start with '69' and have 10 digits.
el: Το κινητό τηλέφωνο πρέπει να ξεκινάει από '69' και να έχει 10 ψηφία.

source: Password
el: Κωδικός πρόσβασης

source: This email already exists. Please use a different email.
el: Το email που εισάγατε έχει χρησιμοποιηθεί ήδη. Θα πρέπει να επιλέξετε διαφορετικό email.

source: This username already exists. Please use a different one.
el: Το όνομα χρήστη που εισάγατε έχει χρησιμοποιηθεί ήδη. Θα πρέπει να επιλέξετε διαφορετικό.

source: Username
el: Όνομα Χρήστη

source: You must accept the service 'terms of use'.
el: Θα πρέπει να αποδεχτείτε τους όρους χρήσης της υπηρεσίας.

source: You must be informed about privacy policy.
el: Θα πρέπει να έχετε ενημερωθεί σχετικά με την πολιτική προστασίας.
